bearxiong99/SmartCityLighting/source/ti/devices/cc26x0r2/inc/hw_smph.h
/******************************************************************************
*  Filename:       hw_smph_h
*  Revised:        2016-05-03 09:51:53 +0200 (Tue, 03 May 2016)
*  Revision:       46239
*
* Copyright (c) 2015 - 2016, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_SMPH_H__
#define __HW_SMPH_H__

//*****************************************************************************
//
// This section defines the register offsets of
// SMPH component
//
//*****************************************************************************
// MCU SEMAPHORE 0
#define SMPH_O_SMPH0                                                0x00000000

// MCU SEMAPHORE 1
#define SMPH_O_SMPH1                                                0x00000004

// MCU SEMAPHORE 2
#define SMPH_O_SMPH2                                                0x00000008

// MCU SEMAPHORE 3
#define SMPH_O_SMPH3                                                0x0000000C

// MCU SEMAPHORE 4
#define SMPH_O_SMPH4                                                0x00000010

// MCU SEMAPHORE 5
#define SMPH_O_SMPH5                                                0x00000014

// MCU SEMAPHORE 6
#define SMPH_O_SMPH6                                                0x00000018

// MCU SEMAPHORE 7
#define SMPH_O_SMPH7                                                0x0000001C

// MCU SEMAPHORE 8
#define SMPH_O_SMPH8                                                0x00000020

// MCU SEMAPHORE 9
#define SMPH_O_SMPH9                                                0x00000024

// MCU SEMAPHORE 10
#define SMPH_O_SMPH10                                               0x00000028

// MCU SEMAPHORE 11
#define SMPH_O_SMPH11                                               0x0000002C

// MCU SEMAPHORE 12
#define SMPH_O_SMPH12                                               0x00000030

// MCU SEMAPHORE 13
#define SMPH_O_SMPH13                                               0x00000034

// MCU SEMAPHORE 14
#define SMPH_O_SMPH14                                               0x00000038

// MCU SEMAPHORE 15
#define SMPH_O_SMPH15                                               0x0000003C

// MCU SEMAPHORE 16
#define SMPH_O_SMPH16                                               0x00000040

// MCU SEMAPHORE 17
#define SMPH_O_SMPH17                                               0x00000044

// MCU SEMAPHORE 18
#define SMPH_O_SMPH18                                               0x00000048

// MCU SEMAPHORE 19
#define SMPH_O_SMPH19                                               0x0000004C

// MCU SEMAPHORE 20
#define SMPH_O_SMPH20                                               0x00000050

// MCU SEMAPHORE 21
#define SMPH_O_SMPH21                                               0x00000054

// MCU SEMAPHORE 22
#define SMPH_O_SMPH22                                               0x00000058

// MCU SEMAPHORE 23
#define SMPH_O_SMPH23                                               0x0000005C

// MCU SEMAPHORE 24
#define SMPH_O_SMPH24                                               0x00000060

// MCU SEMAPHORE 25
#define SMPH_O_SMPH25                                               0x00000064

// MCU SEMAPHORE 26
#define SMPH_O_SMPH26                                               0x00000068

// MCU SEMAPHORE 27
#define SMPH_O_SMPH27                                               0x0000006C

// MCU SEMAPHORE 28
#define SMPH_O_SMPH28                                               0x00000070

// MCU SEMAPHORE 29
#define SMPH_O_SMPH29                                               0x00000074

// MCU SEMAPHORE 30
#define SMPH_O_SMPH30                                               0x00000078

// MCU SEMAPHORE 31
#define SMPH_O_SMPH31                                               0x0000007C

// MCU SEMAPHORE 0 ALIAS
#define SMPH_O_PEEK0                                                0x00000800

// MCU SEMAPHORE 1 ALIAS
#define SMPH_O_PEEK1                                                0x00000804

// MCU SEMAPHORE 2 ALIAS
#define SMPH_O_PEEK2                                                0x00000808

// MCU SEMAPHORE 3 ALIAS
#define SMPH_O_PEEK3                                                0x0000080C

// MCU SEMAPHORE 4 ALIAS
#define SMPH_O_PEEK4                                                0x00000810

// MCU SEMAPHORE 5 ALIAS
#define SMPH_O_PEEK5                                                0x00000814

// MCU SEMAPHORE 6 ALIAS
#define SMPH_O_PEEK6                                                0x00000818

// MCU SEMAPHORE 7 ALIAS
#define SMPH_O_PEEK7                                                0x0000081C

// MCU SEMAPHORE 8 ALIAS
#define SMPH_O_PEEK8                                                0x00000820

// MCU SEMAPHORE 9 ALIAS
#define SMPH_O_PEEK9                                                0x00000824

