bearxiong99/SmartCityLighting/source/ti/devices/cc26x0r2/inc/hw_smph.h
// MCU SEMAPHORE 10 ALIAS
#define SMPH_O_PEEK10                                               0x00000828

// MCU SEMAPHORE 11 ALIAS
#define SMPH_O_PEEK11                                               0x0000082C

// MCU SEMAPHORE 12 ALIAS
#define SMPH_O_PEEK12                                               0x00000830

// MCU SEMAPHORE 13 ALIAS
#define SMPH_O_PEEK13                                               0x00000834

// MCU SEMAPHORE 14 ALIAS
#define SMPH_O_PEEK14                                               0x00000838

// MCU SEMAPHORE 15 ALIAS
#define SMPH_O_PEEK15                                               0x0000083C

// MCU SEMAPHORE 16 ALIAS
#define SMPH_O_PEEK16                                               0x00000840

// MCU SEMAPHORE 17 ALIAS
#define SMPH_O_PEEK17                                               0x00000844

// MCU SEMAPHORE 18 ALIAS
#define SMPH_O_PEEK18                                               0x00000848

// MCU SEMAPHORE 19 ALIAS
#define SMPH_O_PEEK19                                               0x0000084C

// MCU SEMAPHORE 20 ALIAS
#define SMPH_O_PEEK20                                               0x00000850

// MCU SEMAPHORE 21 ALIAS
#define SMPH_O_PEEK21                                               0x00000854

// MCU SEMAPHORE 22 ALIAS
#define SMPH_O_PEEK22                                               0x00000858

// MCU SEMAPHORE 23 ALIAS
#define SMPH_O_PEEK23                                               0x0000085C

// MCU SEMAPHORE 24 ALIAS
#define SMPH_O_PEEK24                                               0x00000860

// MCU SEMAPHORE 25 ALIAS
#define SMPH_O_PEEK25                                               0x00000864

// MCU SEMAPHORE 26 ALIAS
#define SMPH_O_PEEK26                                               0x00000868

// MCU SEMAPHORE 27 ALIAS
#define SMPH_O_PEEK27                                               0x0000086C

// MCU SEMAPHORE 28 ALIAS
#define SMPH_O_PEEK28                                               0x00000870

// MCU SEMAPHORE 29 ALIAS
#define SMPH_O_PEEK29                                               0x00000874

// MCU SEMAPHORE 30 ALIAS
#define SMPH_O_PEEK30                                               0x00000878

// MCU SEMAPHORE 31 ALIAS
#define SMPH_O_PEEK31                                               0x0000087C

//*****************************************************************************
//
// Register: SMPH_O_SMPH0
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH0_STAT                                             0x00000001
#define SMPH_SMPH0_STAT_BITN                                                 0
#define SMPH_SMPH0_STAT_M                                           0x00000001
#define SMPH_SMPH0_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH1
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH1_STAT                                             0x00000001
#define SMPH_SMPH1_STAT_BITN                                                 0
#define SMPH_SMPH1_STAT_M                                           0x00000001
#define SMPH_SMPH1_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH2
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH2_STAT                                             0x00000001
#define SMPH_SMPH2_STAT_BITN                                                 0
#define SMPH_SMPH2_STAT_M                                           0x00000001
#define SMPH_SMPH2_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH3
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH3_STAT                                             0x00000001
#define SMPH_SMPH3_STAT_BITN                                                 0
#define SMPH_SMPH3_STAT_M                                           0x00000001
#define SMPH_SMPH3_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH4
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH4_STAT                                             0x00000001
#define SMPH_SMPH4_STAT_BITN                                                 0
#define SMPH_SMPH4_STAT_M                                           0x00000001
#define SMPH_SMPH4_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH5
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH5_STAT                                             0x00000001
#define SMPH_SMPH5_STAT_BITN                                                 0
#define SMPH_SMPH5_STAT_M                                           0x00000001
#define SMPH_SMPH5_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH6
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH6_STAT                                             0x00000001
#define SMPH_SMPH6_STAT_BITN                                                 0
#define SMPH_SMPH6_STAT_M                                           0x00000001
#define SMPH_SMPH6_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH7
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH7_STAT                                             0x00000001
#define SMPH_SMPH7_STAT_BITN                                                 0
#define SMPH_SMPH7_STAT_M                                           0x00000001
#define SMPH_SMPH7_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH8
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH8_STAT                                             0x00000001
#define SMPH_SMPH8_STAT_BITN                                                 0
#define SMPH_SMPH8_STAT_M                                           0x00000001
#define SMPH_SMPH8_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH9
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH9_STAT                                             0x00000001
#define SMPH_SMPH9_STAT_BITN                                                 0
#define SMPH_SMPH9_STAT_M                                           0x00000001
#define SMPH_SMPH9_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_SMPH10
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH10_STAT                                            0x00000001
#define SMPH_SMPH10_STAT_BITN                                                0
#define SMPH_SMPH10_STAT_M                                          0x00000001
#define SMPH_SMPH10_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH11
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH11_STAT                                            0x00000001
#define SMPH_SMPH11_STAT_BITN                                                0
#define SMPH_SMPH11_STAT_M                                          0x00000001
#define SMPH_SMPH11_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH12
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH12_STAT                                            0x00000001
#define SMPH_SMPH12_STAT_BITN                                                0
#define SMPH_SMPH12_STAT_M                                          0x00000001
#define SMPH_SMPH12_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH13
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH13_STAT                                            0x00000001
#define SMPH_SMPH13_STAT_BITN                                                0
#define SMPH_SMPH13_STAT_M                                          0x00000001
#define SMPH_SMPH13_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH14
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH14_STAT                                            0x00000001
#define SMPH_SMPH14_STAT_BITN                                                0
#define SMPH_SMPH14_STAT_M                                          0x00000001
#define SMPH_SMPH14_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH15
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH15_STAT                                            0x00000001
#define SMPH_SMPH15_STAT_BITN                                                0
#define SMPH_SMPH15_STAT_M                                          0x00000001
#define SMPH_SMPH15_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH16
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH16_STAT                                            0x00000001
#define SMPH_SMPH16_STAT_BITN                                                0
#define SMPH_SMPH16_STAT_M                                          0x00000001
#define SMPH_SMPH16_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH17
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH17_STAT                                            0x00000001
#define SMPH_SMPH17_STAT_BITN                                                0
#define SMPH_SMPH17_STAT_M                                          0x00000001
#define SMPH_SMPH17_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH18
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH18_STAT                                            0x00000001
#define SMPH_SMPH18_STAT_BITN                                                0
#define SMPH_SMPH18_STAT_M                                          0x00000001
#define SMPH_SMPH18_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH19
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH19_STAT                                            0x00000001
#define SMPH_SMPH19_STAT_BITN                                                0
#define SMPH_SMPH19_STAT_M                                          0x00000001
#define SMPH_SMPH19_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH20
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH20_STAT                                            0x00000001
#define SMPH_SMPH20_STAT_BITN                                                0
#define SMPH_SMPH20_STAT_M                                          0x00000001
#define SMPH_SMPH20_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH21
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH21_STAT                                            0x00000001
#define SMPH_SMPH21_STAT_BITN                                                0
#define SMPH_SMPH21_STAT_M                                          0x00000001
#define SMPH_SMPH21_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH22
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH22_STAT                                            0x00000001
#define SMPH_SMPH22_STAT_BITN                                                0
#define SMPH_SMPH22_STAT_M                                          0x00000001
#define SMPH_SMPH22_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH23
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH23_STAT                                            0x00000001
#define SMPH_SMPH23_STAT_BITN                                                0
#define SMPH_SMPH23_STAT_M                                          0x00000001
#define SMPH_SMPH23_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH24
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH24_STAT                                            0x00000001
#define SMPH_SMPH24_STAT_BITN                                                0
#define SMPH_SMPH24_STAT_M                                          0x00000001
#define SMPH_SMPH24_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH25
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH25_STAT                                            0x00000001
#define SMPH_SMPH25_STAT_BITN                                                0
#define SMPH_SMPH25_STAT_M                                          0x00000001
#define SMPH_SMPH25_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH26
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH26_STAT                                            0x00000001
#define SMPH_SMPH26_STAT_BITN                                                0
#define SMPH_SMPH26_STAT_M                                          0x00000001
#define SMPH_SMPH26_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH27
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH27_STAT                                            0x00000001
#define SMPH_SMPH27_STAT_BITN                                                0
#define SMPH_SMPH27_STAT_M                                          0x00000001
#define SMPH_SMPH27_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH28
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH28_STAT                                            0x00000001
#define SMPH_SMPH28_STAT_BITN                                                0
#define SMPH_SMPH28_STAT_M                                          0x00000001
#define SMPH_SMPH28_STAT_S                                                   0

