bearxiong99/SmartCityLighting/source/ti/devices/cc26x0r2/inc/hw_smph.h
//*****************************************************************************
//
// Register: SMPH_O_PEEK29
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK29_STAT                                            0x00000001
#define SMPH_PEEK29_STAT_BITN                                                0
#define SMPH_PEEK29_STAT_M                                          0x00000001
#define SMPH_PEEK29_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK30
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK30_STAT                                            0x00000001
#define SMPH_PEEK30_STAT_BITN                                                0
#define SMPH_PEEK30_STAT_M                                          0x00000001
#define SMPH_PEEK30_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK31
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK31_STAT                                            0x00000001
#define SMPH_PEEK31_STAT_BITN                                                0
#define SMPH_PEEK31_STAT_M                                          0x00000001
#define SMPH_PEEK31_STAT_S                                                   0


#endif // __SMPH__
